sdaiResetArrayIndex(Sdai_Id_aggr*,System.UInt32,System.UInt32)
\details
Resets the index for a specified array: changes the lower and upper bounds of the index value.
\param array [in] An array.
\param lower [in] A new lower index value to be set.
\param upper [in] A new upper index value to be set.